app/views/users/profile.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
            <% if user_signed_in? %>
                <span class="badge"><%= follow.count_new_posts @user %></span>