app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    @post.save

    if @post.errors.empty?
---
INSERT INTO "posts" ("title", "description", "media", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test"], ["description", "Bla"], ["media", "www.youtube.com"], ["user_id", 2], ["created_at", "2015-05-17 09:38:41.614934"], ["updated_at", "2015-05-17 09:38:41.614934"]]
SELECT "posts".* FROM "posts" WHERE (user_id =3)